app/controllers/manager/employees_controller.rb

SELECT "employees".* FROM "employees"   ORDER BY "employees"."name" ASC
---
  def index
    @employees = Employee.order(:name)

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "employees" SET "name" = ?, "updated_at" = ? WHERE "employees"."id" = 1  [["name", "Bob"], ["updated_at", "2014-11-19 21:36:21.247303"]]
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)