app/views/tables/show.html.erb

SELECT "tickets".* FROM "tickets"  WHERE "tickets"."table_id" = ?  [["table_id", 1]]
---
<ul id='tickets'>
  <% @table.tickets.each do |ticket| %>