app/controllers/tables_controller.rb

  def show
    @table = Table.find(params[:id])
---
SELECT  "tables".* FROM "tables"  WHERE "tables"."id" = ? LIMIT 1  [["id", 1]]